app/Shop/Customers/Repositories/CustomerRepository.php

select * from "orders" where "orders"."customer_id" = 14 and "orders"."customer_id" is not null
---
    public function findOrders($columns = ['*'], string $orderBy = 'id') : Collection
    {
        return $this->model->orders()->get($columns)->sortByDesc($orderBy);