app/Shop/Orders/Repositories/OrderRepository.php

update "products" set "quantity" = 9, "updated_at" = '2019-03-04 10:07:21' where "id" = 3
---
    public function associateProduct(Product $product, int $quantity = 1, array $data = [])
    {
        $this->model->products()->attach($product, [
            'quantity' => $quantity,
            'product_name' => $product->name,
            'product_sku' => $product->sku,
            'product_description' => $product->description,
            'product_price' => $product->price,
            'product_attribute_id' => isset($data['product_attribute_id']) ? $data['product_attribute_id']: null,
        ]);

        if($product->is_group_product){
            foreach ($product->products as $item){
                $item->quantity = $item->quantity - $quantity;
                $item->save();
            }
        } else {
            $product->quantity = ($product->quantity - $quantity);
            $product->save();

select * from "customers" where "customers"."id" = 14 and "customers"."deleted_at" is null limit 1
---
    public function sendEmailToCustomer()
    {
        Mail::to($this->model->customer)
            ->send(new SendOrderToCustomerMailable($this->findOrderById($this->model->id)));

select "products".*, "order_product"."order_id" as "pivot_order_id", "order_product"."product_id" as "pivot_product_id", "order_product"."quantity" as "pivot_quantity", "order_product"."product_name" as "pivot_product_name", "order_product"."product_sku" as "pivot_product_sku", "order_product"."product_description" as "pivot_product_description", "order_product"."product_price" as "pivot_product_price", "order_product"."product_attribute_id" as "pivot_product_attribute_id" from "products" inner join "order_product" on "products"."id" = "order_product"."product_id" where "order_product"."order_id" = 2
---
    public function listOrderedProducts() : Collection
    {
        return $this->model->products->map(function (Product $product) {
            $product->name = $product->pivot->product_name;
            $product->sku = $product->pivot->product_sku;
            $product->description = $product->pivot->product_description;
            $product->price = $product->pivot->product_price;
            $product->quantity = $product->pivot->quantity;
            $product->product_attribute_id = $product->pivot->product_attribute_id;
            return $product;
        });