app/Shop/Orders/Repositories/OrderRepository.php

insert into "order_product" ("order_id", "product_attribute_id", "product_description", "product_id", "product_name", "product_price", "product_sku", "quantity") values (5, '', '<p>xvcxvcx</p>', 13, 'vxcxc', '12.00', 'sv', 1)
---
    public function associateProduct(Product $product, int $quantity = 1, array $data = [])
    {
        $this->model->orderProduct()->create([
            'product_id'=>$product->id,
            'quantity' => $quantity,
            'product_name' => $product->name,
            'product_sku' => $product->sku,
            'product_description' => $product->description,
            'product_price' => $product->price,
            'product_attribute_id' => isset($data['product_attribute_id']) ? $data['product_attribute_id']: null,
        ]);