app/Mail/SendOrderToCustomerMailable.php

    public function build()
    {

        $data = [
            'order' => $this->order,
            'products' => $this->order->orderProduct,
            'courier' => $this->order->courier,
            'status' => $this->order->orderStatus,
            'payment' => $this->order->payment
        ];
---
select * from "order_statuses" where "order_statuses"."id" = 5 limit 1